espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/bouffalolab/repo/components/platform/soc/bl702/bl702_std/BSP_Common/isp/wdr_firmware.c
    // histogram pre-processing
    wdr_fw_param.hist_clip_level = BIN_BW - 1;

    // WDR curve
    wdr_fw_param.fw_curve_en = 1;
    wdr_fw_param.exclude_over_under_exp_en = 1;
    wdr_fw_param.swing_gain = 18;
    wdr_fw_param.swing_clip = 14;
    wdr_fw_param.protect_slope = 48;
    wdr_fw_param.curve_keep_bright_level = 4;
    wdr_fw_param.bright_gain = 256;

    // post-enhancement
    wdr_fw_param.fw_enh_en = 1;
    wdr_fw_param.empty_ratio = 20;
    wdr_fw_param.enh_keep_bright_level = 4;
    wdr_fw_param.dark_enh_level = 26;
    wdr_fw_param.bright_enh_level = 26;
    wdr_fw_param.enh_c_gain_base = 34;
    wdr_fw_param.enh_c_gain_extra_slope = 48;

    // fallback
    wdr_fw_param.fw_fallback_en = 1;
    wdr_fw_param.peak_sum_range = 1;
    wdr_fw_param.peak_sum_th = 35;
    wdr_fw_param.peak_sum_slope = 82;
    wdr_fw_param.insignificant_bin_ratio = 8;
    wdr_fw_param.insignificant_bin_num_th = 50;
    wdr_fw_param.insignificant_bin_num_slope = 164;

    // temporal smoothing
    wdr_fw_param.temporal_smooth = 22;

    // initialize IIR
    wdr_reg_fw_iir.cs_grey_th = 0;
    wdr_reg_fw_iir.cs_gain = 1 << CS_GAIN_PRECISION;
    wdr_reg_fw_iir.cs_weight = 0;

    wdr_reg_fw_iir.curve_weight = 0;

    for (int ib = 0; ib < BIN_NUM - 1; ib++) {
        wdr_reg_fw_iir.curve[ib] = ib << HIST_WEIGHT_PRECISION;
    }

    wdr_reg_fw_iir.enh_weight = 0;
    wdr_reg_fw_iir.enh_y_offset = 0;
    wdr_reg_fw_iir.enh_y_gain = 1 << ENH_GAIN_PRECISION;
    wdr_reg_fw_iir.enh_c_gain = 1 << ENH_GAIN_PRECISION;

    // increase IIR register precision to avoid permanent residue
    wdr_reg_fw_iir.cs_grey_th <<= TEMPORAL_IIR_EXTRA_PRECISION;
    wdr_reg_fw_iir.cs_gain <<= TEMPORAL_IIR_EXTRA_PRECISION;
    wdr_reg_fw_iir.cs_weight <<= TEMPORAL_IIR_EXTRA_PRECISION;

    wdr_reg_fw_iir.curve_weight <<= TEMPORAL_IIR_EXTRA_PRECISION;

    for (int ib = 0; ib < BIN_NUM - 1; ib++) {
        wdr_reg_fw_iir.curve[ib] <<= TEMPORAL_IIR_EXTRA_PRECISION;
    }

    wdr_reg_fw_iir.enh_weight <<= TEMPORAL_IIR_EXTRA_PRECISION;
    wdr_reg_fw_iir.enh_y_offset <<= TEMPORAL_IIR_EXTRA_PRECISION;
    wdr_reg_fw_iir.enh_y_gain <<= TEMPORAL_IIR_EXTRA_PRECISION;
    wdr_reg_fw_iir.enh_c_gain <<= TEMPORAL_IIR_EXTRA_PRECISION;
}

static void wdr_hw_init(void)
{
    ISP_WDR_Set_CS_State(ENABLE);
    ISP_WDR_Set_WDR_Curve_State(ENABLE);
    ISP_WDR_Set_Post_Enhance_State(ENABLE);
}

void wdr_hw_update(void)
{
    int i;
    ISP_WDR_Curve_Type wdr_curve;
    ISP_Chroma_Suppress_Type cs_cfg;

    // apply wdr curve
    for (i = 0; i < ISP_WDR_CURVE_COEF_NUM; i++) {
        wdr_curve.curve_coef[i] = wdr_reg.curve[i];
    }

    cs_cfg.gain = wdr_reg.cs_gain;
    cs_cfg.weight = wdr_reg.cs_weight;
    cs_cfg.gain_thresh = wdr_reg.cs_grey_th;

    ISP_WDR_Set_CS_Config(&cs_cfg);
    ISP_WDR_Set_WDR_Curve(&wdr_curve);
    ISP_WDR_Set_WDR_Curve_Weight(wdr_reg.curve_weight);
    ISP_WDR_Set_Post_Enhance_Weight(wdr_reg.enh_weight);
    ISP_WDR_Set_Post_Enhance_Y_Offset(wdr_reg.enh_y_offset);
    ISP_WDR_Set_Post_Enhance_Luma_Gain(wdr_reg.enh_y_gain);
    ISP_WDR_Set_Post_Enhance_Chroma_Gain(wdr_reg.enh_c_gain);
}

int wdr_control(wdr_fw_config_t *config)
{
    // run after each frame hardware done (WDR interrupt)
    wdr_decide_chroma_suppression(config);
    wdr_hist_pre_process();
    wdr_decide_curve();
    wdr_decide_enhancement();
    wdr_decide_fallback(config);
    wdr_temporal_smooth();

    return 0;
}

int wdr_init()
{
    wdr_set_reg_default();
    wdr_fw_param_init();
    wdr_hw_init();

    return 0;
}

int wdr_config(wdr_config_t *config, bool is_virtual_sensor)
{
    wdr_set_hist(config->stats_cfg.act_win.width - 1, config->stats_cfg.act_win.width - 1);
    ISP_WDR_Set_ROI_State(0, ENABLE);
    ISP_WDR_Set_ROI_Weight(0, 1);
    ISP_WDR_Set_ROI_Position(0, 0, config->stats_cfg.act_win.width - 1, 0, config->stats_cfg.act_win.height - 1);

    if (is_virtual_sensor) {
        wdr_fw_param.temporal_smooth = 0;
    }

    return 0;
}

static void wdr_decide_chroma_suppression(wdr_fw_config_t *config)
{
    wdr_reg.cs_en = wdr_fw_param.fw_cs_en;

    if (wdr_fw_param.fw_cs_en) {
        // had better be ISO-adaptive, stronger suppression for larger noise
        wdr_reg_fw_curr.cs_grey_th = config->param.cs_gain_thresh;
        wdr_reg_fw_curr.cs_weight = config->param.cs_weight;

        int divisor = (1 << (PIXEL_BW - 1)) - wdr_reg_fw_curr.cs_grey_th;
        wdr_reg_fw_curr.cs_gain = ((1 << (PIXEL_BW - 1)) * (1 << CS_GAIN_PRECISION) + (divisor - 1)) / divisor;
    } else {
        wdr_reg_fw_curr.cs_grey_th = 0;
        wdr_reg_fw_curr.cs_gain = 1 << CS_GAIN_PRECISION;
        wdr_reg_fw_curr.cs_weight = 0;
    }
}

static void wdr_hist_pre_process()
{
    ISP_WDR_Get_Hist_Data(&wdr_reg.hist);

    // shift histogram
    for (int ib = 0; ib < BIN_NUM; ib++) {
        fw_hist_shift[ib] = wdr_reg.hist.hist_bin[ib] >> HIST_SHIFT_LEVEL;
    }

    // calculate histogram total sum
    hist_shift_total = 0;

    for (int ib = 0; ib < BIN_NUM; ib++) {
        hist_shift_total += fw_hist_shift[ib];
    }

    // clip histogram
    int hist_clip_max = hist_shift_total >> wdr_fw_param.hist_clip_level;

    for (int ib = 0; ib < BIN_NUM; ib++) {
        fw_hist_clip[ib] = MIN(hist_clip_max, fw_hist_shift[ib]);
    }

    if (wdr_fw_param.exclude_over_under_exp_en) {
        fw_hist_clip[0] = 0;
        fw_hist_clip[BIN_NUM - 1] = 0;
    }

    // use integral image to reduce calculation of repetitive summation
    fw_hist_clip_integral[0] = 0;

    for (int ib = 1; ib < BIN_NUM + 1; ib++) {
        fw_hist_clip_integral[ib] = fw_hist_clip_integral[ib - 1] + fw_hist_clip[ib - 1];
    }
}

static void wdr_decide_curve()
{
    wdr_reg.curve_en = wdr_fw_param.fw_curve_en;

    if (wdr_fw_param.fw_curve_en) {
        int curve_ini[BIN_NUM];

        // for assertion
        for (int ib = 0; ib < BIN_NUM; ib++) {
            curve_ini[ib] = -1;
        }

        // decide quarter curve points first
        curve_ini[0] = 0;
        curve_ini[BIN_NUM - 1] = 1 << HIST_PIXEL_BW;

