espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/bouffalolab/repo/components/platform/soc/bl702/bl702_std/BSP_Common/isp/wdr_firmware.c
        curve_ini[BIN_1ST_QUARTER] = wdr_interpolate_curve(BIN_1ST_QUARTER, 0, BIN_NUM - 1, curve_ini[0], curve_ini[BIN_NUM - 1], fw_hist_clip_integral);
        curve_ini[BIN_3RD_QUARTER] = wdr_interpolate_curve(BIN_3RD_QUARTER, 0, BIN_NUM - 1, curve_ini[0], curve_ini[BIN_NUM - 1], fw_hist_clip_integral);

        curve_ini[BIN_2ND_QUARTER] = wdr_interpolate_curve(BIN_2ND_QUARTER, BIN_1ST_QUARTER, BIN_3RD_QUARTER, curve_ini[BIN_1ST_QUARTER], curve_ini[BIN_3RD_QUARTER], fw_hist_clip_integral);

        curve_ini[BIN_1ST_QUARTER] = alpha_blend(BIN_1ST_QUARTER << HIST_WEIGHT_PRECISION, curve_ini[BIN_1ST_QUARTER], wdr_fw_param.curve_keep_bright_level, KEEP_BRIGHT_LEVEL_PRECISION);
        curve_ini[BIN_2ND_QUARTER] = alpha_blend(BIN_2ND_QUARTER << HIST_WEIGHT_PRECISION, curve_ini[BIN_2ND_QUARTER], wdr_fw_param.curve_keep_bright_level, KEEP_BRIGHT_LEVEL_PRECISION);
        curve_ini[BIN_3RD_QUARTER] = alpha_blend(BIN_3RD_QUARTER << HIST_WEIGHT_PRECISION, curve_ini[BIN_3RD_QUARTER], wdr_fw_param.curve_keep_bright_level, KEEP_BRIGHT_LEVEL_PRECISION);

        for (int step = (BIN_NUM - 1) >> 3; step >= 1; step >>= 1) {
            for (int ib = step; ib < BIN_NUM; ib += (step << 1)) {
                int bin_lf = ib - step;
                int bin_rt = ib + step;

                int curve_lf = curve_ini[bin_lf];
                int curve_rt = curve_ini[bin_rt];

                assert(curve_lf != -1);
                assert(curve_rt != -1);

                curve_ini[ib] = wdr_interpolate_curve(ib, bin_lf, bin_rt, curve_lf, curve_rt, fw_hist_clip_integral);
            }
        }

        for (int ib = 0; ib < BIN_NUM; ib++) {
            assert(curve_ini[ib] != -1);

            if (ib > 0) {
                assert(curve_ini[ib] >= curve_ini[ib - 1]);
            }
        }

        // curve smoothing
        curve_ini[BIN_1ST_QUARTER] = (curve_ini[BIN_1ST_QUARTER - 1] + curve_ini[BIN_1ST_QUARTER + 1]) >> 1;
        curve_ini[BIN_2ND_QUARTER] = (curve_ini[BIN_2ND_QUARTER - 1] + curve_ini[BIN_2ND_QUARTER + 1]) >> 1;
        curve_ini[BIN_3RD_QUARTER] = (curve_ini[BIN_3RD_QUARTER - 1] + curve_ini[BIN_3RD_QUARTER + 1]) >> 1;

        for (int ib = 0; ib < BIN_NUM - 1; ib++) {
            if (ib == 0) {
                wdr_reg_fw_curr.curve[ib] = curve_ini[ib];
            } else {
                wdr_reg_fw_curr.curve[ib] = round_off(curve_ini[ib - 1] + (curve_ini[ib] << 1) + curve_ini[ib + 1], 2);
            }
        }

        // adjust brightness
        for (int ib = 0; ib < BIN_NUM - 1; ib++) {
            wdr_reg_fw_curr.curve[ib] = MIN(HIST_PIXEL_MAX, (wdr_reg_fw_curr.curve[ib] * wdr_fw_param.bright_gain) >> BRIGHT_GAIN_PRECISION);
        }
    } else {
        for (int ib = 0; ib < BIN_NUM - 1; ib++) {
            wdr_reg_fw_curr.curve[ib] = ib << HIST_WEIGHT_PRECISION;
        }
    }
}

static int wdr_interpolate_curve(int bin_interp, int bin_lf, int bin_rt, int curve_lf, int curve_rt, int hist_integral[])
{
    // sum [a] ~ [b] = integral [b + 1] - [a]
    int sum_lf = hist_integral[bin_interp + 1] - hist_integral[bin_lf];
    int sum_rt = hist_integral[bin_rt + 1] - hist_integral[bin_interp];

    int curve_linear = ((bin_rt - bin_interp) * curve_lf + (bin_interp - bin_lf) * curve_rt + ((bin_rt - bin_lf) >> 1)) / (bin_rt - bin_lf);
    int curve_blend;

    if (sum_lf + sum_rt == 0) {
        curve_blend = curve_linear;
    } else {
        curve_blend = (sum_rt * curve_lf + sum_lf * curve_rt + ((sum_lf + sum_rt) >> 1)) / (sum_lf + sum_rt);
    }

    assert(within(curve_lf, curve_rt, curve_blend));

    // protect dynamic range at dark and bright sides
    int protect_ratio = PROTECT_RATIO_MAX - MIN(PROTECT_RATIO_MAX, (abs(bin_interp - BIN_2ND_QUARTER) * wdr_fw_param.protect_slope) >> (PROTECT_SLOPE_PRECISION + (BIN_BW - 1) - PROTECT_RATIO_PRECISION));

    int swing_gain_protect = (wdr_fw_param.swing_gain * protect_ratio) >> PROTECT_RATIO_PRECISION;
    int swing_clip_protect = (wdr_fw_param.swing_clip * protect_ratio) >> PROTECT_RATIO_PRECISION;

    int up_swing_gain;
    int dn_swing_gain;
    int up_swing_clip;
    int dn_swing_clip;

    if (bin_interp <= BIN_2ND_QUARTER) {
        up_swing_gain = wdr_fw_param.swing_gain;
        up_swing_clip = wdr_fw_param.swing_clip;

        dn_swing_gain = swing_gain_protect;
        dn_swing_clip = swing_clip_protect;
    } else {
        dn_swing_gain = wdr_fw_param.swing_gain;
        dn_swing_clip = wdr_fw_param.swing_clip;

        up_swing_gain = swing_gain_protect;
        up_swing_clip = swing_clip_protect;
    }

    int up_swing_max = ((curve_rt - curve_linear) * up_swing_clip) >> SWING_CLIP_PRECISION;
    int dn_swing_max = ((curve_linear - curve_lf) * dn_swing_clip) >> SWING_CLIP_PRECISION;

    int swing_ini = curve_blend - curve_linear;
    int swing_gain_mux = (swing_ini >= 0) ? up_swing_gain : dn_swing_gain;
    int swing = clip(-dn_swing_max, up_swing_max, (swing_ini * swing_gain_mux) >> SWING_GAIN_PRECISION);
    int curve_interp = curve_linear + swing;

    assert(within(curve_lf, curve_rt, curve_interp));

    return curve_interp;
}

static void wdr_decide_enhancement()
{
    wdr_reg.enh_en = wdr_fw_param.fw_enh_en;

    if (wdr_fw_param.fw_enh_en) {
        // accumulate histogram from dark and bright ends
        int dark_empty_bin = 0;
        int dark_sum = 0;

        for (int ib = 0; ib < BIN_NUM; ib++) {
            dark_sum += fw_hist_shift[ib];

            if (dark_sum >= ((hist_shift_total * wdr_fw_param.empty_ratio) >> EMPTY_RATIO_PRECISON)) {
                dark_empty_bin = ib;
                break;
            }
        }

        int bright_empty_bin = BIN_NUM - 1;
        int bright_sum = 0;

        for (int ib = BIN_NUM - 1; ib >= 0; ib--) {
            bright_sum += fw_hist_shift[ib];

            if (bright_sum >= ((hist_shift_total * wdr_fw_param.empty_ratio) >> EMPTY_RATIO_PRECISON)) {
                bright_empty_bin = ib;
                break;
            }
        }

        int dark_empty_y = (dark_empty_bin == BIN_NUM - 1) ? (1 << PIXEL_BW) : (wdr_reg_fw_curr.curve[dark_empty_bin] << (PIXEL_BW - HIST_PIXEL_BW));
        int bright_empty_y = (bright_empty_bin == BIN_NUM - 1) ? (1 << PIXEL_BW) : (wdr_reg_fw_curr.curve[bright_empty_bin] << (PIXEL_BW - HIST_PIXEL_BW));

        int dark_shrink_ini = MIN(1 << (PIXEL_BW - 2), (dark_empty_y * wdr_fw_param.dark_enh_level) >> ENH_LEVEL_PRECISION);
        int bright_shrink_ini = MIN(1 << (PIXEL_BW - 2), (((1 << PIXEL_BW) - bright_empty_y) * wdr_fw_param.bright_enh_level) >> ENH_LEVEL_PRECISION);

