espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/bouffalolab/repo/components/platform/soc/bl702/bl702_std/BSP_Common/isp/wdr_firmware.c
        int min_shrink = MIN(dark_shrink_ini, bright_shrink_ini);

        int dark_shrink = alpha_blend(min_shrink, dark_shrink_ini, wdr_fw_param.enh_keep_bright_level, KEEP_BRIGHT_LEVEL_PRECISION);
        int bright_shrink = alpha_blend(min_shrink, bright_shrink_ini, wdr_fw_param.enh_keep_bright_level, KEEP_BRIGHT_LEVEL_PRECISION);

        wdr_reg_fw_curr.enh_y_offset = dark_shrink;
        wdr_reg_fw_curr.enh_y_gain = ((1 << PIXEL_BW) << ENH_GAIN_PRECISION) / ((1 << PIXEL_BW) - (dark_shrink + bright_shrink));

        int enh_c_gain_extra = (dark_shrink * wdr_fw_param.enh_c_gain_extra_slope) >> C_GAIN_SLOPE_PRECISION;
        wdr_reg_fw_curr.enh_c_gain = wdr_reg_fw_curr.enh_y_gain * (wdr_fw_param.enh_c_gain_base + enh_c_gain_extra) >> C_GAIN_RATIO_PRECISION;
    } else {
        wdr_reg_fw_curr.enh_y_offset = 0;
        wdr_reg_fw_curr.enh_y_gain = 1 << ENH_GAIN_PRECISION;
        wdr_reg_fw_curr.enh_c_gain = 1 << ENH_GAIN_PRECISION;
    }
}

static void wdr_decide_fallback(wdr_fw_config_t *config)
{
    if (wdr_fw_param.fw_fallback_en) {
        // fallback when histogram distribution is too concentrated: too high peak and too many insignificant bins
        int peak_bin = 0;
        int peak_hist = -1;

        for (int ib = 0; ib < BIN_NUM; ib++) {
            if (fw_hist_shift[ib] > peak_hist) {
                peak_hist = fw_hist_shift[ib];
                peak_bin = ib;
            }
        }

        int peak_sum = 0;

        for (int ib = peak_bin - wdr_fw_param.peak_sum_range; ib <= peak_bin + wdr_fw_param.peak_sum_range; ib++) {
            if (ib >= 0 && ib < BIN_NUM) {
                peak_sum += fw_hist_shift[ib];
            }
        }

        int insignificant_bin_num = 0;
        int insignificant_bin_th = (hist_shift_total * wdr_fw_param.insignificant_bin_ratio) >> INSIGNIFICANT_BIN_RATIO_PRECISION;

        for (int ib = 0; ib < BIN_NUM; ib++) {
            if (fw_hist_shift[ib] < insignificant_bin_th) {
                insignificant_bin_num++;
            }
        }

        int peak_sum_percent = peak_sum * 100 / hist_shift_total;
        int peak_sum_fallback = clip(0, 1 << FALLBACK_PRECISION, ((peak_sum_percent - wdr_fw_param.peak_sum_th) * wdr_fw_param.peak_sum_slope) >> FALLBACK_SLOPE_PRECISION);

        int insignificant_bin_num_percent = (insignificant_bin_num * 100) >> BIN_BW;
        int insignificant_bin_num_fallback = clip(0, 1 << FALLBACK_PRECISION, ((insignificant_bin_num_percent - wdr_fw_param.insignificant_bin_num_th) * wdr_fw_param.insignificant_bin_num_slope) >> FALLBACK_SLOPE_PRECISION);

        int fallback = MIN(1 << FALLBACK_PRECISION, peak_sum_fallback + insignificant_bin_num_fallback);

        // wdr_reg_fw_curr.curve_weight = FALLBACK_MAX - fallback;
        // wdr_reg_fw_curr.enh_weight = FALLBACK_MAX - fallback;
        wdr_reg_fw_curr.curve_weight = MIN(FALLBACK_MAX - fallback, config->param.curve_weight);
        wdr_reg_fw_curr.enh_weight = MIN(FALLBACK_MAX - fallback, config->param.enh_weight);
    } else {
        wdr_reg_fw_curr.curve_weight = config->param.curve_weight;
        wdr_reg_fw_curr.enh_weight = config->param.enh_weight;
    }
}

static void wdr_temporal_smooth()
{
    wdr_iir_filter(&wdr_reg_fw_iir.cs_grey_th, wdr_reg_fw_curr.cs_grey_th, &wdr_reg.cs_grey_th);
    wdr_iir_filter(&wdr_reg_fw_iir.cs_gain, wdr_reg_fw_curr.cs_gain, &wdr_reg.cs_gain);
    wdr_iir_filter(&wdr_reg_fw_iir.cs_weight, wdr_reg_fw_curr.cs_weight, &wdr_reg.cs_weight);

    wdr_iir_filter(&wdr_reg_fw_iir.curve_weight, wdr_reg_fw_curr.curve_weight, &wdr_reg.curve_weight);

    for (int ib = 0; ib < BIN_NUM - 1; ib++) {
        wdr_iir_filter(&wdr_reg_fw_iir.curve[ib], wdr_reg_fw_curr.curve[ib], &wdr_reg.curve[ib]);
    }

    wdr_iir_filter(&wdr_reg_fw_iir.enh_weight, wdr_reg_fw_curr.enh_weight, &wdr_reg.enh_weight);
    wdr_iir_filter(&wdr_reg_fw_iir.enh_y_offset, wdr_reg_fw_curr.enh_y_offset, &wdr_reg.enh_y_offset);
    wdr_iir_filter(&wdr_reg_fw_iir.enh_y_gain, wdr_reg_fw_curr.enh_y_gain, &wdr_reg.enh_y_gain);
    wdr_iir_filter(&wdr_reg_fw_iir.enh_c_gain, wdr_reg_fw_curr.enh_c_gain, &wdr_reg.enh_c_gain);

    MSG("cs_grey_th %d, cs_gain %d , cs_weight%d , curve_weight %d, enh_weight %d , enh_y_offset %d , enh_y_gain %d\r\n",
        wdr_reg.cs_grey_th, wdr_reg.cs_gain, wdr_reg.cs_weight,
        wdr_reg.curve_weight, wdr_reg.enh_weight, wdr_reg.enh_y_offset, wdr_reg.enh_y_gain);
}

static void wdr_iir_filter(int *iir, int curr, int *result)
{
    *iir = alpha_blend(*iir, curr << TEMPORAL_IIR_EXTRA_PRECISION, wdr_fw_param.temporal_smooth, TEMPORAL_SMOOTH_PRECISION);
    *result = round_off(*iir, TEMPORAL_IIR_EXTRA_PRECISION);
}
